# Задача No17. Решение в группах
# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4] Output: 6

# list = [1, 1, 2, 0, -1, 3, 4, 4]
# multi = set()

# for i in range(len(list)):
#     multi.add(list[i])
# print(len(multi))


# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность 
# (сдвиг - циклический) на K элементов вправо, K – положительное число.
# Input: [1, 2, 3, 4, 5] k = 3 Output: [4, 5, 1, 2, 3]

# list = [1, 2, 3, 4, 5]
# k = int(input("Введите величину сдвига: "))
# print(list)

# for j in range(k):
#     number2 = list[-1]
#     for i in range(len(list)):
#         number1 = list[i]
#         list[i] = number2
#         number2 = number1

# print(list)

# Напишите программу для печати всех уникальных значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# a = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"},
# {"VII": "S005"}, {" V ":" S009 "}, {" VIII":" S007 "}]
# s = set()
# for i in a:
# s.add(*i.values())
# # print(i.values())
# print(*s)

# # Дан массив, состоящий из целых чисел. Напишите программу, 
# # которая подсчитает количество элементов массива, больших предыдущего (элемента с предыдущим номером)
# # Input: [0, -1, 5, 2, 3] Output: 2 (-1 < 5, 2 < 3)

# list = [0, -1, 5, 2, 3]
# i = 1
# sum = 0

# while i < len(list):
# if list[i] > list[i - 1]:
# sum = sum + 1
# i = i + 1

# print(sum)